# 2021 - 2022

In [4]:
#(Master -  2021 to 2022)
import pandas as pd

df1 = pd.read_csv("itcont_2021_2022_filtered.csv", low_memory=False)

In [5]:
df1.columns

Index(['CMTE_ID', 'TRANSACTION_DT', 'TRANSACTION_AMT', 'STATE', 'CITY',
       'ZIP_CODE', 'ENTITY_TP', 'TRANSACTION_TP', 'NAME', 'EMPLOYER',
       'OCCUPATION', 'MEMO_CD', 'SUB_ID'],
      dtype='object')

In [6]:
df1.shape

(63885978, 13)

In [7]:
df1.isnull().sum()

CMTE_ID                   0
TRANSACTION_DT            8
TRANSACTION_AMT          11
STATE                 16514
CITY                   8741
ZIP_CODE              48072
ENTITY_TP               109
TRANSACTION_TP            0
NAME                     16
EMPLOYER            5079504
OCCUPATION          3026134
MEMO_CD            63738841
SUB_ID                   73
dtype: int64

In [9]:
df1['CMTE_ID'].unique()

array(['C00753558', 'C00434563', 'C00785923', ..., 'C00802082',
       'C00773341', 'C00799528'], dtype=object)

In [10]:
df1['STATE'].unique()

array(['FL', 'OR', 'CA', 'VA', 'NY', 'MN', 'NV', 'HI', 'WI', 'LA', 'PA',
       'IL', 'MA', 'CT', 'WA', 'OH', 'NC', 'OK', 'MD', 'IN', 'DC', 'NM',
       'MO', 'SC', 'TX', 'MT', 'MI', 'IA', 'NH', 'DE', 'TN', 'NJ', 'GA',
       'ZZ', 'UT', 'ND', 'AZ', 'AL', 'AR', nan, 'SD', 'CO', 'KY', 'ME',
       'ID', 'RI', 'NE', 'AK', 'VT', 'KS', 'WV', 'MS', 'WY', 'AE', 'AA',
       'PR', 'GU', 'VI', 'AP', 'MP', 'AS', 'FM', 'ON', 'QC', 'BC', 'NS',
       'AB', '46617', 'MB', 'NB', '85015', 'MH', 'SA', 'YT', '-1', 'SK',
       'NL', 'NT', 'TO', 'PW', '07747', '917066511', '03801', 'US',
       '981123717', 'DF', 'PE', 'BO'], dtype=object)

In [11]:
# Filter for US states only (50 states + DC)
us_states = ['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'FL', 'GA', 
             'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD', 
             'MA', 'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 
             'NM', 'NY', 'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 
             'SD', 'TN', 'TX', 'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY', 'DC']

df1 = df1[df1['STATE'].isin(us_states)]

In [12]:
df1.shape

(63780738, 13)

In [15]:
df1 = df1.drop(columns=['MEMO_CD', 'SUB_ID', 'ZIP_CODE', 'CITY','ZIP_CODE'])
df1.shape

(63780738, 9)

In [17]:
df1.isnull().sum()

CMTE_ID                  0
TRANSACTION_DT           8
TRANSACTION_AMT          8
STATE                    0
ENTITY_TP              106
TRANSACTION_TP           0
NAME                    16
EMPLOYER           5059379
OCCUPATION         3011036
dtype: int64

In [18]:
df1 = df1.dropna(subset=[
    'TRANSACTION_DT',
    'TRANSACTION_AMT',
    'STATE',
    'ENTITY_TP',
    'TRANSACTION_TP',
    'NAME'
])
print(df1.isna().sum())

CMTE_ID                  0
TRANSACTION_DT           0
TRANSACTION_AMT          0
STATE                    0
ENTITY_TP                0
TRANSACTION_TP           0
NAME                     0
EMPLOYER           5059297
OCCUPATION         3010953
dtype: int64

In [19]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00753558,9162022.0,25,FL,IND,15E,"ALVAREZ, MANUEL",NOT EMPLOYED,NOT EMPLOYED
1,C00753558,9162022.0,35,OR,IND,15E,"BLOCK, MELANIE",SELF EMPLOYED,DENTURIST
2,C00753558,9162022.0,250,CA,IND,15E,"KELLY, CHARLES",NOT EMPLOYED,NOT EMPLOYED
3,C00753558,9162022.0,25,VA,IND,15E,"PROUTY, NANCY",NOT EMPLOYED,NOT EMPLOYED
4,C00753558,9162022.0,250,NY,IND,15E,"PALMER, DONNA",NOT EMPLOYED,NOT EMPLOYED

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 63780624 entries, 0 to 63885977
Data columns (total 9 columns):
 #   Column           Dtype
---  ------           -----
 0   CMTE_ID          object
 1   TRANSACTION_DT   float64
 2   TRANSACTION_AMT  object
 3   STATE            object
 4   ENTITY_TP        object
 5   TRANSACTION_TP   object
 6   NAME             object
 7   EMPLOYER         object
 8   OCCUPATION       object
dtypes: float64(1), object(8)
memory usage: 4.8+ GB

In [21]:
df1["CMTE_ID"].unique()

array(['C00753558', 'C00434563', 'C00785923', ..., 'C00802082',
       'C00773341', 'C00799528'], dtype=object)

In [22]:
 # Check if CMTE_ID has any NaN values
df1["CMTE_ID"].isna().sum()
df1["CMTE_ID"].isin(["00", "00000000", "0"])

0           False
1           False
2           False
3           False
4           False
            ...
63885973    False
63885974    False
63885975    False
63885976    False
63885977    False
Name: CMTE_ID, Length: 63780624, dtype: bool

In [25]:
print(df1["OCCUPATION"].unique())

['NOT EMPLOYED' 'DENTURIST' 'PRODUCT DESIGNER' ...
 'SUBSTANCE ABUSE ADVISOR' 'HEALTHCARE RESEARCH COMPLIANCE' 'SCULPTOE']

In [24]:
# Count values for OCCUPATION
df1['OCCUPATION'].value_counts()

OCCUPATION
RETIRED                                   23109278
NOT EMPLOYED                              14434651
ATTORNEY                                    788213
PHYSICIAN                                   681477
ENGINEER                                    420132
                                            ...
CALIFORNIA STATE AND WESTERN REGION DI           1
PSYCHIATRIST (ALIGNED WITH CRITICAL PS           1
DIRECTOR, REPORTING AND ANALYSIS  HEAL           1
DEPUTY DIRECTOR, CDRH                            1
SCULPTOE                                         1
Name: count, Length: 289559, dtype: int64

In [26]:
df1['EMPLOYER'] = df1['EMPLOYER'].fillna('Undisclosed')
df1['OCCUPATION'] = df1['OCCUPATION'].fillna('Undisclosed')

In [27]:
df1['EMPLOYER'].value_counts()

EMPLOYER
RETIRED                                   20910753
NOT EMPLOYED                              12881426
Undisclosed                                5059297
SELF                                       2032298
NONE                                       1943808
                                            ...
BENECARDINO EXCAVATING                           1
BYZANTINE HOLDINGS                               1
UNIVERSITY OF ALABAMA SCHOOL OF MEDICI           1
BRUMSEY & BRUMSEY PLLC                           1
YK STONE CENTER                                  1
Name: count, Length: 749454, dtype: int64

In [28]:
df1['OCCUPATION'].value_counts()

OCCUPATION
RETIRED                                   23109278
NOT EMPLOYED                              14434651
Undisclosed                                3010953
ATTORNEY                                    788213
PHYSICIAN                                   681477
                                            ...
CALIFORNIA STATE AND WESTERN REGION DI           1
PSYCHIATRIST (ALIGNED WITH CRITICAL PS           1
DIRECTOR, REPORTING AND ANALYSIS  HEAL           1
DEPUTY DIRECTOR, CDRH                            1
SCULPTOE                                         1
Name: count, Length: 289560, dtype: int64

In [29]:
df1.isnull().sum()

CMTE_ID            0
TRANSACTION_DT     0
TRANSACTION_AMT    0
STATE              0
ENTITY_TP          0
TRANSACTION_TP     0
NAME               0
EMPLOYER           0
OCCUPATION         0
dtype: int64

In [61]:
df1["TRANSACTION_AMT"].unique()

array(['25', '35', '250', ..., '-157500', '9923', '2753'], dtype=object)

In [30]:
# Convert transaction amount to numeric
df1["TRANSACTION_AMT"] = pd.to_numeric(df1["TRANSACTION_AMT"], errors="coerce")

# Drop any NaN (invalid amounts)
df1 = df1.dropna(subset=["TRANSACTION_AMT"])

min_amt = df1["TRANSACTION_AMT"].min()
max_amt = df1["TRANSACTION_AMT"].max()

print(f"ðŸ’µ Transaction amount range: {min_amt:.0f}  â†’  {max_amt:.0f}")

ðŸ’µ Transaction amount range: -500000  â†’  125000000

In [31]:
## import pandas as pd

# âœ… Keep only positive amounts (0 < amt â‰¤ 125000000)
df1 = df1[(df1["TRANSACTION_AMT"] > 0) & (df1["TRANSACTION_AMT"] <= 125_000_000)]

# Optional: reset index for cleanliness
df1 = df1.reset_index(drop=True)

# Verify range
min_amt = df1["TRANSACTION_AMT"].min()
max_amt = df1["TRANSACTION_AMT"].max()
print(f"ðŸ’µ Cleaned transaction amount range: {min_amt:.0f} â†’ {max_amt:.0f}")

ðŸ’µ Cleaned transaction amount range: 1 â†’ 125000000

In [32]:
df1.shape

(61677895, 9)

In [33]:
df1.head(20)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00753558,9162022.0,25.0,FL,IND,15E,"ALVAREZ, MANUEL",NOT EMPLOYED,NOT EMPLOYED
1,C00753558,9162022.0,35.0,OR,IND,15E,"BLOCK, MELANIE",SELF EMPLOYED,DENTURIST
2,C00753558,9162022.0,250.0,CA,IND,15E,"KELLY, CHARLES",NOT EMPLOYED,NOT EMPLOYED
3,C00753558,9162022.0,25.0,VA,IND,15E,"PROUTY, NANCY",NOT EMPLOYED,NOT EMPLOYED
4,C00753558,9162022.0,250.0,NY,IND,15E,"PALMER, DONNA",NOT EMPLOYED,NOT EMPLOYED
5,C00753558,9162022.0,1.0,MN,IND,15E,"ALANEN, DENNIS",NOT EMPLOYED,NOT EMPLOYED
6,C00753558,9162022.0,5.0,NV,IND,15E,"FIRKUS-HICKS, JULIE",NOT EMPLOYED,NOT EMPLOYED
7,C00753558,9162022.0,250.0,CA,IND,15E,"MUELLER, MOLLY",FREEDOM FOREVER,PRODUCT DESIGNER
8,C00753558,9162022.0,35.0,HI,IND,15E,"MAAKE, FISIITETEFA",NOT EMPLOYED,NOT EMPLOYED
9,C00753558,9162022.0,35.0,OR,IND,15E,"SCOTT, CANDIS",NOT EMPLOYED,NOT EMPLOYED
10,C00753558,9162022.0,250.0,WI,IND,15E,"WALSH, JOHN",AXLEY BRYNELSON LLP,ATTORNEY
11,C00753558,9162022.0,10.0,CA,IND,15E,"STRUM, DIANE",NOT EMPLOYED,NOT EMPLOYED
12,C00753558,9162022.0,5.0,LA,IND,15E,"BABIN, KAREN",NOT EMPLOYED,NOT EMPLOYED
13,C00753558,9162022.0,5.0,CA,IND,15E,"DAHLBERG, RICHARD",NOT EMPLOYED,NOT EMPLOYED
14,C00753558,9162022.0,35.0,PA,IND,15E,"MCKINLEY, DAN",NOT EMPLOYED,NOT EMPLOYED
15,C00753558,9162022.0,5.0,IL,IND,15E,"HUG, JERRY",NOT EMPLOYED,NOT EMPLOYED
16,C00753558,9162022.0,250.0,MA,IND,15E,"ROSNICK, PETER",GCC,EDUCATION
17,C00753558,9162022.0,250.0,FL,IND,15E,"PEARSALL, ROBIN",NOT EMPLOYED,NOT EMPLOYED
18,C00753558,9162022.0,1000.0,CA,IND,15E,"JACOBSON, FRED",GENENTECH,SCIENTIST
19,C00753558,9162022.0,500.0,CT,IND,15E,"GREENBLATT, ARTHUR",VESTA CORPORATION,REAL ESTATE

In [34]:
df1["ENTITY_TP"].unique()

array(['IND', 'ORG', 'COM', 'CCM', 'CAN', 'PAC', 'PTY'], dtype=object)

In [35]:
# Replace ENTITY_TP codes with full descriptive names
entity_map = {
    'IND': 'Individual',
    'ORG': 'Organization',
    'COM': 'Committee',
    'CCM': 'Candidate Committee',
    'CAN': 'Candidate',
    'PAC': 'Political Action Committee',
    'PTY': 'Party Organization'
}

df1['ENTITY_TP'] = df1['ENTITY_TP'].replace(entity_map)

In [36]:
df1["ENTITY_TP"].unique()

array(['Individual', 'Organization', 'Committee', 'Candidate Committee',
       'Candidate', 'Political Action Committee', 'Party Organization'],
      dtype=object)

In [38]:
df1.shape

(61677895, 9)

In [39]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00753558,9162022.0,25.0,Florida,Individual,15E,"ALVAREZ, MANUEL",NOT EMPLOYED,NOT EMPLOYED
1,C00753558,9162022.0,35.0,Oregon,Individual,15E,"BLOCK, MELANIE",SELF EMPLOYED,DENTURIST
2,C00753558,9162022.0,250.0,California,Individual,15E,"KELLY, CHARLES",NOT EMPLOYED,NOT EMPLOYED
3,C00753558,9162022.0,25.0,Virginia,Individual,15E,"PROUTY, NANCY",NOT EMPLOYED,NOT EMPLOYED
4,C00753558,9162022.0,250.0,New York,Individual,15E,"PALMER, DONNA",NOT EMPLOYED,NOT EMPLOYED

In [37]:
state_names = {
    'AL': 'Alabama', 'AK': 'Alaska', 'AZ': 'Arizona', 'AR': 'Arkansas',
    'CA': 'California', 'CO': 'Colorado', 'CT': 'Connecticut', 'DE': 'Delaware',
    'FL': 'Florida', 'GA': 'Georgia', 'HI': 'Hawaii', 'ID': 'Idaho',
    'IL': 'Illinois', 'IN': 'Indiana', 'IA': 'Iowa', 'KS': 'Kansas',
    'KY': 'Kentucky', 'LA': 'Louisiana', 'ME': 'Maine', 'MD': 'Maryland',
    'MA': 'Massachusetts', 'MI': 'Michigan', 'MN': 'Minnesota', 'MS': 'Mississippi',
    'MO': 'Missouri', 'MT': 'Montana', 'NE': 'Nebraska', 'NV': 'Nevada',
    'NH': 'New Hampshire', 'NJ': 'New Jersey', 'NM': 'New Mexico', 'NY': 'New York',
    'NC': 'North Carolina', 'ND': 'North Dakota', 'OH': 'Ohio', 'OK': 'Oklahoma',
    'OR': 'Oregon', 'PA': 'Pennsylvania', 'RI': 'Rhode Island', 'SC': 'South Carolina',
    'SD': 'South Dakota', 'TN': 'Tennessee', 'TX': 'Texas', 'UT': 'Utah',
    'VT': 'Vermont', 'VA': 'Virginia', 'WA': 'Washington', 'WV': 'West Virginia',
    'WI': 'Wisconsin', 'WY': 'Wyoming', 'DC': 'District of Columbia',
    'PR': 'Puerto Rico', 'GU': 'Guam', 'VI': 'U.S. Virgin Islands',
    'AS': 'American Samoa', 'MP': 'Northern Mariana Islands'
}

df1['STATE'] = df1['STATE'].replace(state_names)

In [40]:
df1["STATE"].unique()

array(['Florida', 'Oregon', 'California', 'Virginia', 'New York',
       'Minnesota', 'Nevada', 'Hawaii', 'Wisconsin', 'Louisiana',
       'Pennsylvania', 'Illinois', 'Massachusetts', 'Connecticut',
       'Washington', 'Ohio', 'North Carolina', 'Oklahoma', 'Maryland',
       'Indiana', 'District of Columbia', 'New Mexico', 'Missouri',
       'South Carolina', 'Texas', 'Montana', 'Michigan', 'Iowa',
       'New Hampshire', 'Delaware', 'Tennessee', 'New Jersey', 'Georgia',
       'Utah', 'North Dakota', 'Arizona', 'Alabama', 'Arkansas',
       'Colorado', 'Kentucky', 'Maine', 'Idaho', 'Rhode Island',
       'Nebraska', 'Alaska', 'Vermont', 'South Dakota', 'Kansas',
       'West Virginia', 'Mississippi', 'Wyoming'], dtype=object)

In [41]:
df1["TRANSACTION_TP"].unique()

array(['15E', '15', '10', '22Y', '24T', '15C', '11', '20Y', '32E', '32',
       '31', '24I', '31E', '21Y', '32T', '30', '31T', '30E', '42Y', '41Y',
       '30T'], dtype=object)

In [42]:
# Keep only contributions (incoming money)
contribution_codes = ['10', '11', '15', '15C', '15E']
df1 = df1[df1['TRANSACTION_TP'].isin(contribution_codes)]

In [44]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00753558,9162022.0,25.0,Florida,Individual,15E,"ALVAREZ, MANUEL",NOT EMPLOYED,NOT EMPLOYED
1,C00753558,9162022.0,35.0,Oregon,Individual,15E,"BLOCK, MELANIE",SELF EMPLOYED,DENTURIST
2,C00753558,9162022.0,250.0,California,Individual,15E,"KELLY, CHARLES",NOT EMPLOYED,NOT EMPLOYED
3,C00753558,9162022.0,25.0,Virginia,Individual,15E,"PROUTY, NANCY",NOT EMPLOYED,NOT EMPLOYED
4,C00753558,9162022.0,250.0,New York,Individual,15E,"PALMER, DONNA",NOT EMPLOYED,NOT EMPLOYED

In [45]:
# Map TRANSACTION_TP codes to descriptive, readable names
transaction_map = {
    '10': '(10) Contribution to Candidate',
    '11': '(11) Contribution to Party Committee',
    '15': '(15) Contribution from Individual',
    '15C': '(15C) Candidate Self-Funding',
    '15E': '(15E) Earmarked Contribution'
}

df1['TRANSACTION_TP'] = df1['TRANSACTION_TP'].replace(transaction_map)

In [46]:
df1.shape

(31887817, 9)

In [47]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00753558,9162022.0,25.0,Florida,Individual,(15E) Earmarked Contribution,"ALVAREZ, MANUEL",NOT EMPLOYED,NOT EMPLOYED
1,C00753558,9162022.0,35.0,Oregon,Individual,(15E) Earmarked Contribution,"BLOCK, MELANIE",SELF EMPLOYED,DENTURIST
2,C00753558,9162022.0,250.0,California,Individual,(15E) Earmarked Contribution,"KELLY, CHARLES",NOT EMPLOYED,NOT EMPLOYED
3,C00753558,9162022.0,25.0,Virginia,Individual,(15E) Earmarked Contribution,"PROUTY, NANCY",NOT EMPLOYED,NOT EMPLOYED
4,C00753558,9162022.0,250.0,New York,Individual,(15E) Earmarked Contribution,"PALMER, DONNA",NOT EMPLOYED,NOT EMPLOYED

In [48]:
df1["TRANSACTION_DT"].unique()

array([9162022., 9172022., 9182022., ..., 2142022., 2152022., 2162022.])

In [49]:
# Convert TRANSACTION_DT to string first, then to datetime
df1['TRANSACTION_DT'] = df1['TRANSACTION_DT'].astype(int).astype(str)
df1['TRANSACTION_DT'] = pd.to_datetime(df1['TRANSACTION_DT'], format='%m%d%Y')

In [50]:
# Check if sorted in ascending order
is_sorted = df1["TRANSACTION_DT"].is_monotonic_increasing

print("âœ… Is TRANSACTION_DT sorted in ascending order?", is_sorted)

âœ… Is TRANSACTION_DT sorted in ascending order? False

In [51]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00753558,2022-09-16,25.0,Florida,Individual,(15E) Earmarked Contribution,"ALVAREZ, MANUEL",NOT EMPLOYED,NOT EMPLOYED
1,C00753558,2022-09-16,35.0,Oregon,Individual,(15E) Earmarked Contribution,"BLOCK, MELANIE",SELF EMPLOYED,DENTURIST
2,C00753558,2022-09-16,250.0,California,Individual,(15E) Earmarked Contribution,"KELLY, CHARLES",NOT EMPLOYED,NOT EMPLOYED
3,C00753558,2022-09-16,25.0,Virginia,Individual,(15E) Earmarked Contribution,"PROUTY, NANCY",NOT EMPLOYED,NOT EMPLOYED
4,C00753558,2022-09-16,250.0,New York,Individual,(15E) Earmarked Contribution,"PALMER, DONNA",NOT EMPLOYED,NOT EMPLOYED

In [52]:
# Filter for dates between Jan 1, 2021 and Dec 31, 2022
df1 = df1[(df1['TRANSACTION_DT'] >= '2021-01-01') & (df1['TRANSACTION_DT'] <= '2022-12-31')]

# Verify the date range
print(df1['TRANSACTION_DT'].min())
print(df1['TRANSACTION_DT'].max())

2021-01-10 00:00:00
2022-12-31 00:00:00

In [53]:
# Sort by TRANSACTION_DT in ascending order
df1 = df1.sort_values('TRANSACTION_DT')

# Verify it's sorted
print("âœ… Is TRANSACTION_DT sorted in ascending order?", df1["TRANSACTION_DT"].is_monotonic_increasing)

âœ… Is TRANSACTION_DT sorted in ascending order? True

In [54]:
df1.head(20)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
49284430,C00618371,2021-01-10,100.0,Missouri,Individual,(15E) Earmarked Contribution,"TOWEY, NANCY",USBANK,BRANCH MANAGER
49283498,C00633404,2021-01-10,8.0,New York,Individual,(15E) Earmarked Contribution,"POGGIOLI, SUSAN",AURORA PRODUCTIONS INTL INC,ACCOUNTANT
49283497,C00633404,2021-01-10,5.0,Alabama,Individual,(15E) Earmarked Contribution,"PITTARD, JOEL",LEE OBGYN,PHYSICIAN
49283496,C00633404,2021-01-10,300.0,New York,Individual,(15E) Earmarked Contribution,"PERSHING, SANDRA",NOT EMPLOYED,NOT EMPLOYED
49283495,C00633404,2021-01-10,1000.0,Florida,Individual,(15E) Earmarked Contribution,"RAZACK, ADNAN",EDMC,PROFESSOR
49283494,C00633404,2021-01-10,25.0,Washington,Individual,(15E) Earmarked Contribution,"HILBERG, PAMELA",NOT EMPLOYED,NOT EMPLOYED
49283493,C00633404,2021-01-10,25.0,Washington,Individual,(15E) Earmarked Contribution,"HILBERG, PAMELA",NOT EMPLOYED,NOT EMPLOYED
49283492,C00633404,2021-01-10,25.0,Washington,Individual,(15E) Earmarked Contribution,"HILBERG, PAMELA",NOT EMPLOYED,NOT EMPLOYED
49283491,C00633404,2021-01-10,25.0,Washington,Individual,(15E) Earmarked Contribution,"HILBERG, PAMELA",NOT EMPLOYED,NOT EMPLOYED
49283490,C00633404,2021-01-10,15.0,Washington,Individual,(15E) Earmarked Contribution,"HILBERG, PAMELA",NOT EMPLOYED,NOT EMPLOYED
49283489,C00639591,2021-01-10,50.0,New York,Individual,(15E) Earmarked Contribution,"BACHERT, JASON",STATE OF NEW YORK,LIBRARIAN
49283488,C00639591,2021-01-10,50.0,New York,Individual,(15E) Earmarked Contribution,"KEENAN, SCOTT",TEVA PHARMACEUTICALS,RESEARCH QUALITY ASSURANCE
49283487,C00639591,2021-01-10,5.0,New York,Individual,(15E) Earmarked Contribution,"NEWELL, ALAN",NONE,NONE
49283486,C00639591,2021-01-10,50.0,New Jersey,Individual,(15E) Earmarked Contribution,"ANDERSON, DENNIS",NONE,RETIRED
49283485,C00639591,2021-01-10,50.0,Alabama,Individual,(15E) Earmarked Contribution,"KARRH, JERRY",NOT EMPLOYED,NOT EMPLOYED
49283484,C00639591,2021-01-10,27.0,Florida,Individual,(15E) Earmarked Contribution,"KARBE, BETH",SELF,ACUPUNCTURE
49283483,C00639591,2021-01-10,500.0,New Jersey,Individual,(15E) Earmarked Contribution,"HERMAN, HARPER",NOT EMPLOYED,NOT EMPLOYED
49283482,C00639591,2021-01-10,10.0,California,Individual,(15E) Earmarked Contribution,"FAGAN, ZACK",FUSIONSTORM,ENGINEER
49283481,C00639591,2021-01-10,50.0,Michigan,Individual,(15E) Earmarked Contribution,"REYNOLDS, COLLIN",ITHAKA,SOFTWARE ENGINEER
49283480,C00633404,2021-01-10,15.0,Colorado,Individual,(15E) Earmarked Contribution,"FERET, JEFF",STONEBRIDGE HOSPITALITY,HOUSEKEEPING SUPERVISOR

In [55]:
df1.tail(20)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
25861456,C00000935,2022-12-31,25.0,New York,Individual,(15E) Earmarked Contribution,"LITCHMAN, DEBORAH",SELF-EMPLOYED,EDUCATIONAL CONSULTANT
25861455,C00000935,2022-12-31,7.0,New Mexico,Individual,(15E) Earmarked Contribution,"HUGHES, KIARA",ALBUQUERQUE PUBLIC SCHOOLS,SUBSTITUTE TEACHER/ANTHROPOLOGIST
25861454,C00000935,2022-12-31,38.0,North Carolina,Individual,(15E) Earmarked Contribution,"HOWARTH, IRMA",Undisclosed,RETIRED
25861453,C00000935,2022-12-31,100.0,South Carolina,Individual,(15E) Earmarked Contribution,"MILLER, PAUL",UNIVERSITY OF SOUTH CAROLINA,PROFESSOR
25861452,C00000935,2022-12-31,25.0,Massachusetts,Individual,(15E) Earmarked Contribution,"LURVEY, BARBARA",Undisclosed,NOT EMPLOYED
25861451,C00000935,2022-12-31,23.0,Connecticut,Individual,(15E) Earmarked Contribution,"LURIE, STEVEN",SELF-EMPLOYED,PSYCHOLOGIST
25861450,C00000935,2022-12-31,75.0,Oregon,Individual,(15E) Earmarked Contribution,"KOBAYASHI, GEORGE",Undisclosed,RETIRED
25861449,C00000935,2022-12-31,100.0,Oregon,Individual,(15E) Earmarked Contribution,"KOBAYASHI, GEORGE",Undisclosed,RETIRED
25861448,C00000935,2022-12-31,6.0,New York,Individual,(15E) Earmarked Contribution,"JOHNSON, MARY",Undisclosed,NOT EMPLOYED
25861447,C00000935,2022-12-31,25.0,Michigan,Individual,(15E) Earmarked Contribution,"JOHNSON, MARY",Undisclosed,RETIRED
25861446,C00000935,2022-12-31,25.0,New Jersey,Individual,(15E) Earmarked Contribution,"HENDERSON, JAMES",Undisclosed,NOT EMPLOYED
25861445,C00000935,2022-12-31,35.0,New Jersey,Individual,(15E) Earmarked Contribution,"HENDERSON, JAMES",Undisclosed,NOT EMPLOYED
25861444,C00000935,2022-12-31,6.0,Georgia,Individual,(15E) Earmarked Contribution,"HENDERSON, HILLARY",CLEARLEAP,DIRECTOR OF PRODUCT STRATEGY
25861443,C00000935,2022-12-31,5.0,North Carolina,Individual,(15E) Earmarked Contribution,"PORT, JEAN",WILD CAT KNOB ENTERPRISES,SOCIAL WORK
25861442,C00000935,2022-12-31,20.0,Virginia,Individual,(15E) Earmarked Contribution,"STREET, MATHEW",AMERICAN BANKERS ASSOCIATION,ATTORNEY
25861441,C00000935,2022-12-31,50.0,Missouri,Individual,(15E) Earmarked Contribution,"SEYFRIED, WARREN",WASHINGTON UNIVERSITY,DATABASE ANALYST
25861440,C00000935,2022-12-31,15.0,Pennsylvania,Individual,(15E) Earmarked Contribution,"WALLS, RACHEL",CHEF SOFTWARE,CONSULTANT
25861439,C00000935,2022-12-31,25.0,Pennsylvania,Individual,(15E) Earmarked Contribution,"SUSS, PAULA",SUSS CONSULTING INC.,SECRETARY
25861461,C00000935,2022-12-31,25.0,California,Individual,(15E) Earmarked Contribution,"NORTH, SALLY",LAUSD,EDUCATOR
25857425,C00042366,2022-12-31,25.0,California,Individual,(15E) Earmarked Contribution,"HUANG, MARGARET",NONE,NOT EMPLOYED

In [56]:
df1.shape

(31610404, 9)

In [57]:
# Save cleaned dataset for Tableau
df1.to_csv("Individual_contribution_2021_2022.csv", index=False)
print("âœ… File saved as: Individual_contribution_2021_2022.csv")

âœ… File saved as: Individual_contribution_2021_2022.csv

# 2023 - 2024

In [58]:
#(Master -  2023 to 2024)
import pandas as pd

df1 = pd.read_csv("itcont_2023_2024_filtered.csv", low_memory=False)

In [59]:
df1.columns

Index(['CMTE_ID', 'TRANSACTION_DT', 'TRANSACTION_AMT', 'STATE', 'CITY',
       'ZIP_CODE', 'ENTITY_TP', 'TRANSACTION_TP', 'NAME', 'EMPLOYER',
       'OCCUPATION', 'MEMO_CD', 'SUB_ID'],
      dtype='object')

In [60]:
df1.shape

(58271239, 13)

In [61]:
df1.isnull().sum()

CMTE_ID                   0
TRANSACTION_DT          328
TRANSACTION_AMT          18
STATE                 11982
CITY                   4634
ZIP_CODE              37851
ENTITY_TP               340
TRANSACTION_TP            0
NAME                    266
EMPLOYER            4453148
OCCUPATION          2301570
MEMO_CD            58070286
SUB_ID                   78
dtype: int64

In [62]:
df1['CMTE_ID'].unique()

array(['C00281212', 'C00873893', 'C00401224', ..., 'C00845198',
       'C00710871', 'C00886374'], dtype=object)

In [63]:
df1['STATE'].unique()

array(['FL', 'MI', 'VA', 'MD', 'NC', 'AZ', 'NH', 'MA', 'TX', 'NY', 'PA',
       'MN', 'CA', 'KY', 'NJ', 'GA', 'NV', 'UT', 'KS', 'TN', 'AK', 'ME',
       'AL', 'AR', 'IL', 'OH', 'OR', 'WA', 'IA', 'WY', 'IN', 'MT', 'SC',
       'WV', 'OK', 'HI', 'WI', 'DC', 'MS', 'DE', 'CO', 'CT', 'NE', 'MO',
       'LA', 'RI', 'NM', 'AP', 'ID', 'VT', 'ZZ', 'SD', 'ND', 'PR', 'GU',
       'VI', 'AE', nan, 'ON', 'AA', 'AS', 'BC', 'NS', 'MP', 'AB', 'NL',
       '95818', 'NB', 'QC', 'FR', 'FM', '46617', 'PW', '10011',
       '958194420', '631416320', '109601400', '06798', 'MH'], dtype=object)

In [64]:
# Filter for US states only (50 states + DC)
us_states = ['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'FL', 'GA', 
             'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD', 
             'MA', 'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 
             'NM', 'NY', 'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 
             'SD', 'TN', 'TX', 'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY', 'DC']

df1 = df1[df1['STATE'].isin(us_states)]

In [65]:
df1 = df1.drop(columns=['MEMO_CD', 'SUB_ID', 'ZIP_CODE', 'CITY','ZIP_CODE'])
df1.shape

(58168453, 9)

In [66]:
df1.isnull().sum()

CMTE_ID                  0
TRANSACTION_DT         261
TRANSACTION_AMT         16
STATE                    0
ENTITY_TP              260
TRANSACTION_TP           0
NAME                   198
EMPLOYER           4437873
OCCUPATION         2290947
dtype: int64

In [67]:
df1 = df1.dropna(subset=[
    'TRANSACTION_DT',
    'TRANSACTION_AMT',
    'STATE',
    'ENTITY_TP',
    'TRANSACTION_TP',
    'NAME'
])
print(df1.isna().sum())

CMTE_ID                  0
TRANSACTION_DT           0
TRANSACTION_AMT          0
STATE                    0
ENTITY_TP                0
TRANSACTION_TP           0
NAME                     0
EMPLOYER           4437783
OCCUPATION         2290850
dtype: int64

In [68]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00281212,11302023.0,10,FL,IND,15,"AVERY, ROGER",BAE SYSTEMS JACKSONVILLE SRLLC,SPV II- CRAFT
1,C00281212,11172023.0,20,MI,IND,15,"MALIK, AMER",BAE SYSTEMS CONTROLS INC,ENG SR PRIN II - SYS
2,C00281212,11022023.0,17,VA,IND,15,"MALLETT, ERIC",BAE SYSTEMS NORFOLK SHP REPAIR,SPV I- CRAFT
3,C00281212,11162023.0,10,VA,IND,15,"SAUNDERS, DAVID",BAE SYSTEMS NORFOLK SHP REPAIR,MGR II- ESTIMATING
4,C00281212,11032023.0,38,VA,IND,15,"SMITH, MARK","BAE SYSTEMS, INC",CHIEF GOVT COMPLIANCE OFFICER

In [69]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 58167953 entries, 0 to 58271238
Data columns (total 9 columns):
 #   Column           Dtype
---  ------           -----
 0   CMTE_ID          object
 1   TRANSACTION_DT   float64
 2   TRANSACTION_AMT  object
 3   STATE            object
 4   ENTITY_TP        object
 5   TRANSACTION_TP   object
 6   NAME             object
 7   EMPLOYER         object
 8   OCCUPATION       object
dtypes: float64(1), object(8)
memory usage: 4.3+ GB

In [70]:
df1["CMTE_ID"].unique()

array(['C00281212', 'C00873893', 'C00401224', ..., 'C00845198',
       'C00710871', 'C00886374'], dtype=object)

In [71]:
 # Check if CMTE_ID has any NaN values
df1["CMTE_ID"].isna().sum()
df1["CMTE_ID"].isin(["00", "00000000", "0"])

0           False
1           False
2           False
3           False
4           False
            ...
58271234    False
58271235    False
58271236    False
58271237    False
58271238    False
Name: CMTE_ID, Length: 58167953, dtype: bool

In [72]:
df1["OCCUPATION"].unique()

array(['SPV II- CRAFT', 'ENG SR PRIN II - SYS', 'SPV I- CRAFT', ...,
       'OWNER / CPA', 'SSRA', "RETIRED WOMEN'S CENTER DIRECTOR"],
      dtype=object)

In [73]:
# Count values for OCCUPATION
df1['OCCUPATION'].value_counts()

OCCUPATION
RETIRED                              18289030
NOT EMPLOYED                         16277616
ATTORNEY                               858537
PHYSICIAN                              621940
ENGINEER                               395746
                                       ...
DIETITIAN AT HEIGHT                         1
DIETITIAN/DIABETES EDUCATOR                 1
OWNER/FINE ART, WINE + RECEPTIONS           1
ASSITANT PRINCIPAL                          1
RETIRED WOMEN'S CENTER DIRECTOR             1
Name: count, Length: 336190, dtype: int64

In [74]:
df1['EMPLOYER'] = df1['EMPLOYER'].fillna('Undisclosed')
df1['OCCUPATION'] = df1['OCCUPATION'].fillna('Undisclosed')

In [75]:
df1['EMPLOYER'].value_counts()

EMPLOYER
RETIRED                        16107529
NOT EMPLOYED                   14800873
Undisclosed                     4437783
NONE                            1702154
SELF-EMPLOYED                   1361913
                                 ...
UNIVERSITY OF KENTUCKY/SELF           1
ROBINSON PAVING, INC.                 1
PLANETARY VC                          1
BEHRINGER CRAWFORD MUSEUM             1
PATS DECORATOR                        1
Name: count, Length: 946933, dtype: int64

In [76]:
df1['OCCUPATION'].value_counts()

OCCUPATION
RETIRED                            18289030
NOT EMPLOYED                       16277616
Undisclosed                         2290850
ATTORNEY                             858537
PHYSICIAN                            621940
                                     ...
SATELLITE TV SALES & MARKETING            1
SELF PROPERTY MANAGMENT                   1
WORLEY WAREHOUSING INC.                   1
PART TMIE DELIVERY DRIVER                 1
RETIRED WOMEN'S CENTER DIRECTOR           1
Name: count, Length: 336191, dtype: int64

In [77]:
df1.isnull().sum()

CMTE_ID            0
TRANSACTION_DT     0
TRANSACTION_AMT    0
STATE              0
ENTITY_TP          0
TRANSACTION_TP     0
NAME               0
EMPLOYER           0
OCCUPATION         0
dtype: int64

In [78]:
df1["TRANSACTION_AMT"].unique()

array(['10', '20', '17', ..., '-1698', '54025', '39737'], dtype=object)

In [79]:
# Convert transaction amount to numeric
df1["TRANSACTION_AMT"] = pd.to_numeric(df1["TRANSACTION_AMT"], errors="coerce")

# Drop any NaN (invalid amounts)
df1 = df1.dropna(subset=["TRANSACTION_AMT"])

min_amt = df1["TRANSACTION_AMT"].min()
max_amt = df1["TRANSACTION_AMT"].max()

print(f"ðŸ’µ Transaction amount range: {min_amt:.0f}  â†’  {max_amt:.0f}")

ðŸ’µ Transaction amount range: -7000000  â†’  90000000

In [80]:
## import pandas as pd

# âœ… Keep only positive amounts (0 < amt â‰¤ 90000000)
df1 = df1[(df1["TRANSACTION_AMT"] > 0) & (df1["TRANSACTION_AMT"] <= 90000000)]

# Optional: reset index for cleanliness
df1 = df1.reset_index(drop=True)

# Verify range
min_amt = df1["TRANSACTION_AMT"].min()
max_amt = df1["TRANSACTION_AMT"].max()
print(f"ðŸ’µ Cleaned transaction amount range: {min_amt:.0f} â†’ {max_amt:.0f}")

ðŸ’µ Cleaned transaction amount range: 1 â†’ 90000000

In [81]:
df1.shape

(55471326, 9)

In [82]:
df1.head(20)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00281212,11302023.0,10.0,FL,IND,15,"AVERY, ROGER",BAE SYSTEMS JACKSONVILLE SRLLC,SPV II- CRAFT
1,C00281212,11172023.0,20.0,MI,IND,15,"MALIK, AMER",BAE SYSTEMS CONTROLS INC,ENG SR PRIN II - SYS
2,C00281212,11022023.0,17.0,VA,IND,15,"MALLETT, ERIC",BAE SYSTEMS NORFOLK SHP REPAIR,SPV I- CRAFT
3,C00281212,11162023.0,10.0,VA,IND,15,"SAUNDERS, DAVID",BAE SYSTEMS NORFOLK SHP REPAIR,MGR II- ESTIMATING
4,C00281212,11032023.0,38.0,VA,IND,15,"SMITH, MARK","BAE SYSTEMS, INC",CHIEF GOVT COMPLIANCE OFFICER
5,C00281212,11172023.0,38.0,VA,IND,15,"SMITH, MARK","BAE SYSTEMS, INC",CHIEF GOVT COMPLIANCE OFFICER
6,C00281212,11032023.0,10.0,MD,IND,15,"SMITH, MICHAEL",BAE SYSTEMS TECH SOLS&SVCS INC,DIR I- PROGRAMS
7,C00281212,11172023.0,10.0,MD,IND,15,"SMITH, MICHAEL",BAE SYSTEMS TECH SOLS&SVCS INC,DIR I- PROGRAMS
8,C00281212,11172023.0,40.0,NC,IND,15,"SMITH, DANIELLE",BAE SYSTEMS SHARED SVCS INC,VP- INFO TECH
9,C00281212,11032023.0,20.0,MD,IND,15,"SMITH, CICELY","BAE SYSTEMS, INC",MGR II- COMPLIANCE
10,C00281212,11172023.0,20.0,MD,IND,15,"SMITH, CICELY","BAE SYSTEMS, INC",MGR II- COMPLIANCE
11,C00281212,11032023.0,40.0,NC,IND,15,"SMITH, DANIELLE",BAE SYSTEMS SHARED SVCS INC,VP- INFO TECH
12,C00281212,11032023.0,25.0,MD,IND,15,"SMITH, JAMES III",BAE SYSTEMS TECH SOLS&SVCS INC,MGR II- ENG
13,C00281212,11172023.0,25.0,MD,IND,15,"SMITH, JAMES III",BAE SYSTEMS TECH SOLS&SVCS INC,MGR II- ENG
14,C00281212,11032023.0,21.0,MI,IND,15,"JEROUE, RICHARD",BAE SYSTEMS LAND&ARMAMENTS LP,MGR I- FACILITIES
15,C00281212,11162023.0,50.0,AZ,IND,15,"JANIK, RICHARD",BAE SYSTEMS INFO&ELEC SYS INTG,DIR II- BUSINESS DEV
16,C00281212,11302023.0,50.0,AZ,IND,15,"JANIK, RICHARD",BAE SYSTEMS INFO&ELEC SYS INTG,DIR II- BUSINESS DEV
17,C00281212,11032023.0,192.0,NH,IND,15,"JELALIAN, LESLIE","BAE SYSTEMS, INC",SVP STRATEGY & CORPORATE DEV'T
18,C00281212,11172023.0,192.0,NH,IND,15,"JELALIAN, LESLIE","BAE SYSTEMS, INC",SVP STRATEGY & CORPORATE DEV'T
19,C00281212,11022023.0,192.0,MA,IND,15,"CRIMMINS, TERENCE",BAE SYSTEMS INFO&ELEC SYS INTG,PRES - ELECTRONIC SYSTEMS

In [83]:
df1["ENTITY_TP"].unique()

array(['IND', 'PTY', 'ORG', 'CAN', 'PAC', 'CCM', 'COM'], dtype=object)

In [84]:
# Replace ENTITY_TP codes with full descriptive names
entity_map = {
    'IND': 'Individual',
    'ORG': 'Organization',
    'COM': 'Committee',
    'CCM': 'Candidate Committee',
    'CAN': 'Candidate',
    'PAC': 'Political Action Committee',
    'PTY': 'Party Organization'
}

df1['ENTITY_TP'] = df1['ENTITY_TP'].replace(entity_map)

In [85]:
df1["ENTITY_TP"].unique()

array(['Individual', 'Party Organization', 'Organization', 'Candidate',
       'Political Action Committee', 'Candidate Committee', 'Committee'],
      dtype=object)

In [86]:
df1.shape

(55471326, 9)

In [87]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00281212,11302023.0,10.0,FL,Individual,15,"AVERY, ROGER",BAE SYSTEMS JACKSONVILLE SRLLC,SPV II- CRAFT
1,C00281212,11172023.0,20.0,MI,Individual,15,"MALIK, AMER",BAE SYSTEMS CONTROLS INC,ENG SR PRIN II - SYS
2,C00281212,11022023.0,17.0,VA,Individual,15,"MALLETT, ERIC",BAE SYSTEMS NORFOLK SHP REPAIR,SPV I- CRAFT
3,C00281212,11162023.0,10.0,VA,Individual,15,"SAUNDERS, DAVID",BAE SYSTEMS NORFOLK SHP REPAIR,MGR II- ESTIMATING
4,C00281212,11032023.0,38.0,VA,Individual,15,"SMITH, MARK","BAE SYSTEMS, INC",CHIEF GOVT COMPLIANCE OFFICER

In [88]:
state_names = {
    'AL': 'Alabama', 'AK': 'Alaska', 'AZ': 'Arizona', 'AR': 'Arkansas',
    'CA': 'California', 'CO': 'Colorado', 'CT': 'Connecticut', 'DE': 'Delaware',
    'FL': 'Florida', 'GA': 'Georgia', 'HI': 'Hawaii', 'ID': 'Idaho',
    'IL': 'Illinois', 'IN': 'Indiana', 'IA': 'Iowa', 'KS': 'Kansas',
    'KY': 'Kentucky', 'LA': 'Louisiana', 'ME': 'Maine', 'MD': 'Maryland',
    'MA': 'Massachusetts', 'MI': 'Michigan', 'MN': 'Minnesota', 'MS': 'Mississippi',
    'MO': 'Missouri', 'MT': 'Montana', 'NE': 'Nebraska', 'NV': 'Nevada',
    'NH': 'New Hampshire', 'NJ': 'New Jersey', 'NM': 'New Mexico', 'NY': 'New York',
    'NC': 'North Carolina', 'ND': 'North Dakota', 'OH': 'Ohio', 'OK': 'Oklahoma',
    'OR': 'Oregon', 'PA': 'Pennsylvania', 'RI': 'Rhode Island', 'SC': 'South Carolina',
    'SD': 'South Dakota', 'TN': 'Tennessee', 'TX': 'Texas', 'UT': 'Utah',
    'VT': 'Vermont', 'VA': 'Virginia', 'WA': 'Washington', 'WV': 'West Virginia',
    'WI': 'Wisconsin', 'WY': 'Wyoming', 'DC': 'District of Columbia',
    'PR': 'Puerto Rico', 'GU': 'Guam', 'VI': 'U.S. Virgin Islands',
    'AS': 'American Samoa', 'MP': 'Northern Mariana Islands'
}

df1['STATE'] = df1['STATE'].replace(state_names)

In [89]:
df1["STATE"].unique()

array(['Florida', 'Michigan', 'Virginia', 'Maryland', 'North Carolina',
       'Arizona', 'New Hampshire', 'Massachusetts', 'Texas', 'New York',
       'Pennsylvania', 'Minnesota', 'California', 'Kentucky',
       'New Jersey', 'Georgia', 'Utah', 'Kansas', 'Tennessee', 'Alaska',
       'Alabama', 'Arkansas', 'Illinois', 'Ohio', 'Oregon', 'Washington',
       'Iowa', 'Wyoming', 'South Carolina', 'West Virginia', 'Oklahoma',
       'Hawaii', 'Wisconsin', 'District of Columbia', 'Indiana',
       'Mississippi', 'Delaware', 'Colorado', 'Connecticut', 'Nebraska',
       'Missouri', 'Louisiana', 'Rhode Island', 'Nevada', 'New Mexico',
       'Maine', 'Idaho', 'Montana', 'Vermont', 'South Dakota',
       'North Dakota'], dtype=object)

In [90]:
df1["TRANSACTION_TP"].unique()

array(['15', '15E', '24T', '22Y', '11', '15C', '10', '24I', '20Y', '32',
       '31', '31E', '30', '32E', '32T', '21Y', '31T', '30T', '42Y', '41Y',
       '30E'], dtype=object)

In [91]:
# Keep only contributions (incoming money)
contribution_codes = ['10', '11', '15', '15C', '15E']
df1 = df1[df1['TRANSACTION_TP'].isin(contribution_codes)]

In [92]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00281212,11302023.0,10.0,Florida,Individual,15,"AVERY, ROGER",BAE SYSTEMS JACKSONVILLE SRLLC,SPV II- CRAFT
1,C00281212,11172023.0,20.0,Michigan,Individual,15,"MALIK, AMER",BAE SYSTEMS CONTROLS INC,ENG SR PRIN II - SYS
2,C00281212,11022023.0,17.0,Virginia,Individual,15,"MALLETT, ERIC",BAE SYSTEMS NORFOLK SHP REPAIR,SPV I- CRAFT
3,C00281212,11162023.0,10.0,Virginia,Individual,15,"SAUNDERS, DAVID",BAE SYSTEMS NORFOLK SHP REPAIR,MGR II- ESTIMATING
4,C00281212,11032023.0,38.0,Virginia,Individual,15,"SMITH, MARK","BAE SYSTEMS, INC",CHIEF GOVT COMPLIANCE OFFICER

In [93]:
# Map TRANSACTION_TP codes to descriptive, readable names
transaction_map = {
    '10': '(10) Contribution to Candidate',
    '11': '(11) Contribution to Party Committee',
    '15': '(15) Contribution from Individual',
    '15C': '(15C) Candidate Self-Funding',
    '15E': '(15E) Earmarked Contribution'
}

df1['TRANSACTION_TP'] = df1['TRANSACTION_TP'].replace(transaction_map)

In [94]:
df1.shape

(47352380, 9)

In [95]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00281212,11302023.0,10.0,Florida,Individual,(15) Contribution from Individual,"AVERY, ROGER",BAE SYSTEMS JACKSONVILLE SRLLC,SPV II- CRAFT
1,C00281212,11172023.0,20.0,Michigan,Individual,(15) Contribution from Individual,"MALIK, AMER",BAE SYSTEMS CONTROLS INC,ENG SR PRIN II - SYS
2,C00281212,11022023.0,17.0,Virginia,Individual,(15) Contribution from Individual,"MALLETT, ERIC",BAE SYSTEMS NORFOLK SHP REPAIR,SPV I- CRAFT
3,C00281212,11162023.0,10.0,Virginia,Individual,(15) Contribution from Individual,"SAUNDERS, DAVID",BAE SYSTEMS NORFOLK SHP REPAIR,MGR II- ESTIMATING
4,C00281212,11032023.0,38.0,Virginia,Individual,(15) Contribution from Individual,"SMITH, MARK","BAE SYSTEMS, INC",CHIEF GOVT COMPLIANCE OFFICER

In [96]:
df1["TRANSACTION_DT"].unique()

array([11302023., 11172023., 11022023., ..., 10242025.,  8042022.,
        8182022.])

In [97]:
# Convert TRANSACTION_DT to string first, then to datetime
df1['TRANSACTION_DT'] = df1['TRANSACTION_DT'].astype(int).astype(str)
df1['TRANSACTION_DT'] = pd.to_datetime(df1['TRANSACTION_DT'], format='%m%d%Y')

In [98]:
# Check if sorted in ascending order
is_sorted = df1["TRANSACTION_DT"].is_monotonic_increasing

print("âœ… Is TRANSACTION_DT sorted in ascending order?", is_sorted)

âœ… Is TRANSACTION_DT sorted in ascending order? False

In [99]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00281212,2023-11-30,10.0,Florida,Individual,(15) Contribution from Individual,"AVERY, ROGER",BAE SYSTEMS JACKSONVILLE SRLLC,SPV II- CRAFT
1,C00281212,2023-11-17,20.0,Michigan,Individual,(15) Contribution from Individual,"MALIK, AMER",BAE SYSTEMS CONTROLS INC,ENG SR PRIN II - SYS
2,C00281212,2023-11-02,17.0,Virginia,Individual,(15) Contribution from Individual,"MALLETT, ERIC",BAE SYSTEMS NORFOLK SHP REPAIR,SPV I- CRAFT
3,C00281212,2023-11-16,10.0,Virginia,Individual,(15) Contribution from Individual,"SAUNDERS, DAVID",BAE SYSTEMS NORFOLK SHP REPAIR,MGR II- ESTIMATING
4,C00281212,2023-11-03,38.0,Virginia,Individual,(15) Contribution from Individual,"SMITH, MARK","BAE SYSTEMS, INC",CHIEF GOVT COMPLIANCE OFFICER

In [100]:
# Filter for dates between Jan 1, 2023 and Dec 31, 2024
df1 = df1[(df1['TRANSACTION_DT'] >= '2023-01-01') & (df1['TRANSACTION_DT'] <= '2024-12-31')]

# Verify the date range
print(df1['TRANSACTION_DT'].min())
print(df1['TRANSACTION_DT'].max())

2023-01-10 00:00:00
2024-12-31 00:00:00

In [101]:
# Sort by TRANSACTION_DT in ascending order
df1 = df1.sort_values('TRANSACTION_DT')

# Verify it's sorted
print("âœ… Is TRANSACTION_DT sorted in ascending order?", df1["TRANSACTION_DT"].is_monotonic_increasing)

âœ… Is TRANSACTION_DT sorted in ascending order? True

In [102]:
df1.head(10)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
10805677,C00770941,2023-01-10,100.0,Missouri,Individual,(15E) Earmarked Contribution,"LACKAMP, ROBERT",SELF-EMPLOYED,PHYSICISN
24889496,C00770941,2023-01-10,1.0,New Jersey,Individual,(15E) Earmarked Contribution,"GINA, ALEXANDRA",RETIRED,RETIRED
24889497,C00770941,2023-01-10,10.0,New Jersey,Individual,(15E) Earmarked Contribution,"GINA, ALEXANDRA",RETIRED,RETIRED
24889498,C00770941,2023-01-10,7.0,New Jersey,Individual,(15E) Earmarked Contribution,"GINA, ALEXANDRA",RETIRED,RETIRED
4623150,C00401224,2023-01-10,10.0,California,Individual,(15) Contribution from Individual,"WEBSTER, JOHN",QUEST DIAGNOSTICS,CYTOGENETIC TECHNOLOGIST
24889499,C00770941,2023-01-10,20.0,New Jersey,Individual,(15E) Earmarked Contribution,"GINA, ALEXANDRA",RETIRED,RETIRED
24889500,C00770941,2023-01-10,50.0,Oregon,Individual,(15E) Earmarked Contribution,"GIRARD, GEORGE",RETIRED,RETIRED
24889511,C00770941,2023-01-10,3.0,Texas,Individual,(15E) Earmarked Contribution,"BASSHAM, MARK",RETIRED,RETIRED
14735797,C00748582,2023-01-10,250.0,Massachusetts,Individual,(10) Contribution to Candidate,"RHODES, JASON",ATLAS VENTURE,BIOTECH
5590478,C00401224,2023-01-10,1.0,Arizona,Individual,(15) Contribution from Individual,"JONES, NANCY F",NOT EMPLOYED,NOT EMPLOYED

In [103]:
df1.tail(20)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
26341521,C00770941,2024-12-31,25.0,New Mexico,Individual,(15E) Earmarked Contribution,"BRADY, JAMES",RETIRED,RETIRED
20592187,C00388983,2024-12-31,115.0,Florida,Individual,(15) Contribution from Individual,"LAWSON, ROBERT WILLIAM","ARCADIS U.S., INC.",NATIONAL DISCIPLINE LEADER
32932740,C00106146,2024-12-31,57.0,Illinois,Individual,(15) Contribution from Individual,"CHICKEY, REBECCA MS. MPH",AMERICAN HOSPITAL ASSOCIATION,"SENIOR DIRECTOR FIELD ENGAGEMENT, BEHA"
20592172,C00414896,2024-12-31,57.0,California,Individual,(15) Contribution from Individual,"CHOPRA, MOHINDER",OSI SYSTEMS,"VP, MIS"
20592185,C00388983,2024-12-31,576.0,Alabama,Individual,(15) Contribution from Individual,"FLANNELLY, PATRICK R","ARCADIS U.S., INC.",AREA LEADER 2
20592184,C00388983,2024-12-31,30.0,Florida,Individual,(15) Contribution from Individual,"FIERRO, PEDRO","ARCADIS U.S., INC.",ACCOUNT LEADER 4
20592183,C00388983,2024-12-31,210.0,Texas,Individual,(15) Contribution from Individual,"DIAS, KEITH G.","ARCADIS U.S., INC.",GLOBAL ACCOUNT LEADER 2
20592182,C00388983,2024-12-31,75.0,Indiana,Individual,(15) Contribution from Individual,"COPELAND, EDWARD","ARCADIS U.S., INC.",GLOBAL ACCOUNT LEADER 1
20592181,C00388983,2024-12-31,150.0,Ohio,Individual,(15) Contribution from Individual,"ARMSTRONG, THOMAS P","ARCADIS U.S., INC.",AREA LEADER 1
24179935,C00194084,2024-12-31,475.0,Texas,Individual,(15) Contribution from Individual,"SAENZ, JENNIFER","ALBERTSONS COMPANIES, INC.","EVP, CHIEF MERCHANDISING OFFICER"
26341513,C00770941,2024-12-31,7.0,New York,Individual,(15E) Earmarked Contribution,"BIVIANO, GLEN",GJB TRANS,TRUCK DRIVER
20592180,C00414896,2024-12-31,115.0,California,Individual,(15) Contribution from Individual,"ALSTON, THEODORE J. JR.",RAPISCAN SECURITY,"VP, CUSTOMER SERVICE"
20592178,C00414896,2024-12-31,28.0,Massachusetts,Individual,(15) Contribution from Individual,"HACK, DAVID",AS&E,SENIOR VP
20592177,C00414896,2024-12-31,57.0,California,Individual,(15) Contribution from Individual,"GRINDSTAFF, GLENN","OSI SYSTEMS, INC.",CHIEF HUMAN RESOURCES OFFICER
20592176,C00414896,2024-12-31,300.0,California,Individual,(15) Contribution from Individual,"GREENBERG, JOSH",OSI SYSTEMS,ASSOCIATE COUNSEL
20592175,C00414896,2024-12-31,28.0,California,Individual,(15) Contribution from Individual,"FUENTES, MIGUEL",RAPISCAN SYSTEMS,PRODUCTION AND FACILITIES MANAGER
20592174,C00414896,2024-12-31,115.0,California,Individual,(15) Contribution from Individual,"COOK, CHRISTOPHER","OSI SYSTEMS, INC.",VP OF CORPORATE COMPLIANCE
20592173,C00414896,2024-12-31,115.0,Virginia,Individual,(15) Contribution from Individual,"CONNOR, MEGAN","RAPISCAN SYSTEMS, INC.","DIRECTOR, CONTRACT MANAGEMENT"
20592179,C00414896,2024-12-31,115.0,New Hampshire,Individual,(15) Contribution from Individual,"KELLEY, CHRISTOPHER",AMERICAN SCIENCE AND ENGINEERI,GLOOBAL SENIOR DIRECTOR
12651760,C00027466,2024-12-31,25.0,Illinois,Individual,(15E) Earmarked Contribution,"SCHULZ, MARTIN",RETIRED,RETIRED

In [104]:
df1.shape

(47343832, 9)

In [105]:
# Save cleaned dataset for Tableau
df1.to_csv("Individual_contribution_2023_2024.csv", index=False)
print("âœ… File saved as: Individual_contribution_2023_2024.csv")

âœ… File saved as: Individual_contribution_2023_2024.csv

# 2019 - 2020

In [106]:
#(Master -  2019 to 2020)
import pandas as pd

df1 = pd.read_csv("itcont_2019_2020_filtered.csv", low_memory=False)

In [107]:
df1.columns

Index(['CMTE_ID', 'TRANSACTION_DT', 'TRANSACTION_AMT', 'STATE', 'CITY',
       'ZIP_CODE', 'ENTITY_TP', 'TRANSACTION_TP', 'NAME', 'EMPLOYER',
       'OCCUPATION', 'MEMO_CD', 'SUB_ID'],
      dtype='object')

In [108]:
df1.shape

(69377425, 13)

In [109]:
df1.head(20)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,CITY,ZIP_CODE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION,MEMO_CD,SUB_ID
0,C00618371,9112020.0,45,PA,EASTON,18040,IND,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER,NaN,4.022220e+18
1,C00618371,9042020.0,35,PA,EASTON,18040,IND,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER,NaN,4.022220e+18
2,C00618371,9092020.0,75,TX,HOUSTON,77001,IND,15E,"FISHER, GERALD",RETIRED,RETIRED,NaN,4.022220e+18
3,C00618371,9062020.0,100,IL,OSWEGO,60543,IND,15E,"FORNECKER, BOB",NAPERVILLE ELECTRICAL CONTRACTORS,OWNER,NaN,4.022220e+18
4,C00618371,9082020.0,105,GA,VIDALIA,30474,IND,15,"FORNEL, HELGA",NaN,NaN,NaN,4.022220e+18
5,C00618371,9062020.0,25,NJ,TRENTON,08601,IND,15E,"FLANNER, GREGG",FLANNER ASSOCIATES,MFG REP,NaN,4.022220e+18
6,C00618371,9062020.0,25,NJ,TRENTON,08601,IND,15E,"FLANNER, GREGG",FLANNER ASSOCIATES,MFG REP,NaN,4.022220e+18
7,C00618371,9082020.0,25,NJ,TRENTON,08601,IND,15E,"FLANNER, GREGG",FLANNER ASSOCIATES,MFG REP,NaN,4.022220e+18
8,C00618371,9092020.0,15,NJ,TRENTON,08601,IND,15E,"FLANNER, GREGG",FLANNER ASSOCIATES,MFG REP,NaN,4.022220e+18
9,C00618371,9022020.0,100,VA,ROANOKE,24001,IND,15E,"FRALIN, CYNTHIA",RETIRED,RETIRED,NaN,4.022220e+18
10,C00618371,9042020.0,505,LA,EUNICE,70535,IND,15,"FREDERICK, DANNY",SELF-EMPLOYED,CPA,NaN,4.022220e+18
11,C00618371,9032020.0,15,NY,NORTH BELLMORE,00000,IND,15E,"FINE, BRIAN",RETIRED,RETIRED,NaN,4.022220e+18
12,C00618371,9022020.0,500,FL,THE VILLAGES,32162,IND,15E,"FITZPATRICK, BERNARD",RETIRED,RETIRED,NaN,4.022220e+18
13,C00618371,9032020.0,500,FL,THE VILLAGES,32162,IND,15E,"FITZPATRICK, BERNARD",RETIRED,RETIRED,NaN,4.022220e+18
14,C00618371,9052020.0,25,CA,SHERMAN OAKS,91403,IND,15E,"FLYNN, AMY",ALINA KUTSEVOL,RE BROKER,NaN,4.022220e+18
15,C00618371,9062020.0,12,CA,WALNUT,91788,IND,15E,"FRAME, ELENA",RETIRED,RETIRED,NaN,4.022220e+18
16,C00618371,9062020.0,100,CA,WALNUT,91788,IND,15E,"FRAME, ELENA",RETIRED,RETIRED,NaN,4.022220e+18
17,C00618371,9072020.0,100,CA,WALNUT,91788,IND,15E,"FRAME, ELENA",RETIRED,RETIRED,NaN,4.022220e+18
18,C00618371,9052020.0,42,WI,MILWAUKEE,53224,IND,15E,"FIELDS, NICHOLE",LUTHER MANOR,RN,NaN,4.022220e+18
19,C00618371,9032020.0,42,TX,HOUSTON,77001,IND,15E,"FLOWERS, ERA",RETIRED,RETIRED,NaN,4.022220e+18

In [110]:
df1.isnull().sum()

CMTE_ID                   0
TRANSACTION_DT           62
TRANSACTION_AMT          43
STATE                 17345
CITY                   5811
ZIP_CODE              40472
ENTITY_TP               215
TRANSACTION_TP            0
NAME                     45
EMPLOYER            5605949
OCCUPATION          3245402
MEMO_CD            69045188
SUB_ID                  113
dtype: int64

In [111]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69377425 entries, 0 to 69377424
Data columns (total 13 columns):
 #   Column           Dtype
---  ------           -----
 0   CMTE_ID          object
 1   TRANSACTION_DT   float64
 2   TRANSACTION_AMT  object
 3   STATE            object
 4   CITY             object
 5   ZIP_CODE         object
 6   ENTITY_TP        object
 7   TRANSACTION_TP   object
 8   NAME             object
 9   EMPLOYER         object
 10  OCCUPATION       object
 11  MEMO_CD          object
 12  SUB_ID           float64
dtypes: float64(2), object(11)
memory usage: 6.7+ GB

In [112]:
df1['CMTE_ID'].unique()

array(['C00618371', 'C00200584', 'C00461244', ..., 'C00671669',
       'C00660977', 'C00700849'], dtype=object)

In [113]:
df1['STATE'].unique()

array(['PA', 'TX', 'IL', 'GA', 'NJ', 'VA', 'LA', 'NY', 'FL', 'CA', 'WI',
       'AK', 'WA', 'AL', 'IN', 'ID', 'NC', 'VT', 'AZ', 'OH', 'MI', 'RI',
       'SC', 'MO', 'MA', 'SD', 'IA', 'TN', 'MD', 'CT', 'AR', 'MT', 'MN',
       'CO', 'NV', 'NM', 'OK', 'HI', 'MS', 'OR', 'ND', 'DC', 'NH', 'KS',
       'ME', 'ZZ', 'WY', 'UT', 'NE', 'KY', 'DE', 'PR', 'WV', 'AP', 'AE',
       'VI', nan, 'AA', 'AB', 'AS', 'NS', 'ON', 'BC', 'MB', 'MP', 'GU',
       'QC', 'IR', '-1', 'YT', 'NL', '07302', '303383936', 'NB', 'PW',
       'SK', 'SO', 'FM', 'MH', '180171017', 'RM', 'NT', 'PE', 'SP',
       '016091204', '466171852', 'GR', '46617', 'NR', 'TY', 'EN', 'UK',
       'WP', 'BL', 'SA', '22827', '07922', '85029', 'TI', 'GE', '20171',
       'TO', 'BO', 'BS', '80401', 'BE', 'VE', 'BG', 'OF', 'HO', 'LL',
       'NU'], dtype=object)

In [114]:
# Filter for US states only (50 states + DC)
us_states = ['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'FL', 'GA', 
             'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD', 
             'MA', 'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 
             'NM', 'NY', 'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 
             'SD', 'TN', 'TX', 'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY', 'DC']

df1 = df1[df1['STATE'].isin(us_states)]

In [115]:
df1 = df1.drop(columns=['MEMO_CD', 'SUB_ID', 'ZIP_CODE', 'CITY','ZIP_CODE'])
df1.shape

(69205422, 9)

In [116]:
df1.isnull().sum()

CMTE_ID                  0
TRANSACTION_DT          62
TRANSACTION_AMT         30
STATE                    0
ENTITY_TP              204
TRANSACTION_TP           0
NAME                    44
EMPLOYER           5577512
OCCUPATION         3221143
dtype: int64

In [117]:
df1 = df1.dropna(subset=[
    'TRANSACTION_DT',
    'TRANSACTION_AMT',
    'STATE',
    'ENTITY_TP',
    'TRANSACTION_TP',
    'NAME'
])
print(df1.isna().sum())

CMTE_ID                  0
TRANSACTION_DT           0
TRANSACTION_AMT          0
STATE                    0
ENTITY_TP                0
TRANSACTION_TP           0
NAME                     0
EMPLOYER           5577366
OCCUPATION         3221002
dtype: int64

In [118]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00618371,9112020.0,45,PA,IND,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
1,C00618371,9042020.0,35,PA,IND,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
2,C00618371,9092020.0,75,TX,IND,15E,"FISHER, GERALD",RETIRED,RETIRED
3,C00618371,9062020.0,100,IL,IND,15E,"FORNECKER, BOB",NAPERVILLE ELECTRICAL CONTRACTORS,OWNER
4,C00618371,9082020.0,105,GA,IND,15,"FORNEL, HELGA",NaN,NaN

In [119]:
df1["CMTE_ID"].unique()

array(['C00618371', 'C00200584', 'C00461244', ..., 'C00671669',
       'C00660977', 'C00700849'], dtype=object)

In [120]:
 # Check if CMTE_ID has any NaN values
df1["CMTE_ID"].isna().sum()
df1["CMTE_ID"].isin(["00", "00000000", "0"])

0           False
1           False
2           False
3           False
4           False
            ...
69377420    False
69377421    False
69377422    False
69377423    False
69377424    False
Name: CMTE_ID, Length: 69205181, dtype: bool

In [121]:
df1["OCCUPATION"].unique()

array(['CAREGIVER', 'RETIRED', 'OWNER', ..., 'TEACHER VOLUNTEER',
       'REAL ESTATE PROPERTY BUSINESS', 'RANCHER/ REAL ESTATE INVESTOR'],
      dtype=object)

In [122]:
# Count values for OCCUPATION
df1['OCCUPATION'].value_counts()

OCCUPATION
NOT EMPLOYED                     20309395
RETIRED                          10765114
ATTORNEY                          1490823
PHYSICIAN                         1099604
NONE                              1060895
                                   ...
FNP PMHNP                               1
DIR FED. & LEG. AFFAIRS                 1
CO-FOUNDER, BALLMER GROUP               1
ART / DESIGN                            1
RANCHER/ REAL ESTATE INVESTOR           1
Name: count, Length: 410842, dtype: int64

In [123]:
df1['EMPLOYER'] = df1['EMPLOYER'].fillna('Undisclosed')
df1['OCCUPATION'] = df1['OCCUPATION'].fillna('Undisclosed')

In [124]:
df1['EMPLOYER'].value_counts()

EMPLOYER
NOT EMPLOYED                  17827362
RETIRED                        8273244
Undisclosed                    5577366
NONE                           4169069
SELF                           2665216
                                ...
CULP WATER TRUCK SERVICE             1
VERADEPT INC.                        1
ROCKY MOUNTAIN PACKING CO.           1
F.N.B. BANK                          1
SAQUS                                1
Name: count, Length: 1205739, dtype: int64

In [125]:
df1['OCCUPATION'].value_counts()

OCCUPATION
NOT EMPLOYED                     20309395
RETIRED                          10765114
Undisclosed                       3221002
ATTORNEY                          1490823
PHYSICIAN                         1099604
                                   ...
PARCEL LEAD                             1
MARKETING SPEC                          1
AGENT 516                               1
KNOX COUNTY BOARD OF ED.                1
RANCHER/ REAL ESTATE INVESTOR           1
Name: count, Length: 410843, dtype: int64

In [126]:
df1.isnull().sum()

CMTE_ID            0
TRANSACTION_DT     0
TRANSACTION_AMT    0
STATE              0
ENTITY_TP          0
TRANSACTION_TP     0
NAME               0
EMPLOYER           0
OCCUPATION         0
dtype: int64

In [127]:
df1["TRANSACTION_AMT"].unique()

array(['45', '35', '75', ..., '22755', '17187', '50002'], dtype=object)

In [128]:
# Convert transaction amount to numeric
df1["TRANSACTION_AMT"] = pd.to_numeric(df1["TRANSACTION_AMT"], errors="coerce")

# Drop any NaN (invalid amounts)
df1 = df1.dropna(subset=["TRANSACTION_AMT"])

min_amt = df1["TRANSACTION_AMT"].min()
max_amt = df1["TRANSACTION_AMT"].max()

print(f"ðŸ’µ Transaction amount range: {min_amt:.0f}  â†’  {max_amt:.0f}")

ðŸ’µ Transaction amount range: -762300  â†’  125000000

In [129]:
## import pandas as pd

# âœ… Keep only positive amounts (0 < amt â‰¤ 125000000)
df1 = df1[(df1["TRANSACTION_AMT"] > 0) & (df1["TRANSACTION_AMT"] <= 125000000)]

# Optional: reset index for cleanliness
df1 = df1.reset_index(drop=True)

# Verify range
min_amt = df1["TRANSACTION_AMT"].min()
max_amt = df1["TRANSACTION_AMT"].max()
print(f"ðŸ’µ Cleaned transaction amount range: {min_amt:.0f} â†’ {max_amt:.0f}")

ðŸ’µ Cleaned transaction amount range: 1 â†’ 125000000

In [130]:
df1.shape

(67789522, 9)

In [131]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00618371,9112020.0,45.0,PA,IND,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
1,C00618371,9042020.0,35.0,PA,IND,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
2,C00618371,9092020.0,75.0,TX,IND,15E,"FISHER, GERALD",RETIRED,RETIRED
3,C00618371,9062020.0,100.0,IL,IND,15E,"FORNECKER, BOB",NAPERVILLE ELECTRICAL CONTRACTORS,OWNER
4,C00618371,9082020.0,105.0,GA,IND,15,"FORNEL, HELGA",Undisclosed,Undisclosed

In [132]:
df1["ENTITY_TP"].unique()

array(['IND', 'ORG', 'COM', 'CAN', 'CCM', 'PAC', 'PTY'], dtype=object)

In [133]:
# Replace ENTITY_TP codes with full descriptive names
entity_map = {
    'IND': 'Individual',
    'ORG': 'Organization',
    'COM': 'Committee',
    'CCM': 'Candidate Committee',
    'CAN': 'Candidate',
    'PAC': 'Political Action Committee',
    'PTY': 'Party Organization'
}

df1['ENTITY_TP'] = df1['ENTITY_TP'].replace(entity_map)

In [134]:
df1["ENTITY_TP"].unique()

array(['Individual', 'Organization', 'Committee', 'Candidate',
       'Candidate Committee', 'Political Action Committee',
       'Party Organization'], dtype=object)

In [135]:
df1.shape

(67789522, 9)

In [136]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00618371,9112020.0,45.0,PA,Individual,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
1,C00618371,9042020.0,35.0,PA,Individual,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
2,C00618371,9092020.0,75.0,TX,Individual,15E,"FISHER, GERALD",RETIRED,RETIRED
3,C00618371,9062020.0,100.0,IL,Individual,15E,"FORNECKER, BOB",NAPERVILLE ELECTRICAL CONTRACTORS,OWNER
4,C00618371,9082020.0,105.0,GA,Individual,15,"FORNEL, HELGA",Undisclosed,Undisclosed

In [137]:
state_names = {
    'AL': 'Alabama', 'AK': 'Alaska', 'AZ': 'Arizona', 'AR': 'Arkansas',
    'CA': 'California', 'CO': 'Colorado', 'CT': 'Connecticut', 'DE': 'Delaware',
    'FL': 'Florida', 'GA': 'Georgia', 'HI': 'Hawaii', 'ID': 'Idaho',
    'IL': 'Illinois', 'IN': 'Indiana', 'IA': 'Iowa', 'KS': 'Kansas',
    'KY': 'Kentucky', 'LA': 'Louisiana', 'ME': 'Maine', 'MD': 'Maryland',
    'MA': 'Massachusetts', 'MI': 'Michigan', 'MN': 'Minnesota', 'MS': 'Mississippi',
    'MO': 'Missouri', 'MT': 'Montana', 'NE': 'Nebraska', 'NV': 'Nevada',
    'NH': 'New Hampshire', 'NJ': 'New Jersey', 'NM': 'New Mexico', 'NY': 'New York',
    'NC': 'North Carolina', 'ND': 'North Dakota', 'OH': 'Ohio', 'OK': 'Oklahoma',
    'OR': 'Oregon', 'PA': 'Pennsylvania', 'RI': 'Rhode Island', 'SC': 'South Carolina',
    'SD': 'South Dakota', 'TN': 'Tennessee', 'TX': 'Texas', 'UT': 'Utah',
    'VT': 'Vermont', 'VA': 'Virginia', 'WA': 'Washington', 'WV': 'West Virginia',
    'WI': 'Wisconsin', 'WY': 'Wyoming', 'DC': 'District of Columbia',
    'PR': 'Puerto Rico', 'GU': 'Guam', 'VI': 'U.S. Virgin Islands',
    'AS': 'American Samoa', 'MP': 'Northern Mariana Islands'
}

df1['STATE'] = df1['STATE'].replace(state_names)

In [138]:
df1["STATE"].unique()

array(['Pennsylvania', 'Texas', 'Illinois', 'Georgia', 'New Jersey',
       'Virginia', 'Louisiana', 'New York', 'Florida', 'California',
       'Wisconsin', 'Alaska', 'Washington', 'Alabama', 'Indiana', 'Idaho',
       'North Carolina', 'Vermont', 'Arizona', 'Ohio', 'Michigan',
       'Rhode Island', 'South Carolina', 'Missouri', 'Massachusetts',
       'South Dakota', 'Iowa', 'Tennessee', 'Maryland', 'Connecticut',
       'Arkansas', 'Montana', 'Minnesota', 'Colorado', 'Nevada',
       'New Mexico', 'Oklahoma', 'Hawaii', 'Mississippi', 'Oregon',
       'North Dakota', 'District of Columbia', 'New Hampshire', 'Kansas',
       'Maine', 'Wyoming', 'Utah', 'Nebraska', 'Kentucky', 'Delaware',
       'West Virginia'], dtype=object)

In [139]:
df1["TRANSACTION_TP"].unique()

array(['15E', '15', '10', '24T', '11', '22Y', '15C', '24I', '20Y', '31E',
       '32', '31', '32E', '21Y', '42Y', '30', '30E', '31T', '30T', '32T',
       '41Y'], dtype=object)

In [140]:
# Keep only contributions (incoming money)
contribution_codes = ['10', '11', '15', '15C', '15E']
df1 = df1[df1['TRANSACTION_TP'].isin(contribution_codes)]

In [141]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00618371,9112020.0,45.0,Pennsylvania,Individual,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
1,C00618371,9042020.0,35.0,Pennsylvania,Individual,15E,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
2,C00618371,9092020.0,75.0,Texas,Individual,15E,"FISHER, GERALD",RETIRED,RETIRED
3,C00618371,9062020.0,100.0,Illinois,Individual,15E,"FORNECKER, BOB",NAPERVILLE ELECTRICAL CONTRACTORS,OWNER
4,C00618371,9082020.0,105.0,Georgia,Individual,15,"FORNEL, HELGA",Undisclosed,Undisclosed

In [142]:
# Map TRANSACTION_TP codes to descriptive, readable names
transaction_map = {
    '10': '(10) Contribution to Candidate',
    '11': '(11) Contribution to Party Committee',
    '15': '(15) Contribution from Individual',
    '15C': '(15C) Candidate Self-Funding',
    '15E': '(15E) Earmarked Contribution'
}

df1['TRANSACTION_TP'] = df1['TRANSACTION_TP'].replace(transaction_map)

In [143]:
df1.shape

(44253810, 9)

In [144]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00618371,9112020.0,45.0,Pennsylvania,Individual,(15E) Earmarked Contribution,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
1,C00618371,9042020.0,35.0,Pennsylvania,Individual,(15E) Earmarked Contribution,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
2,C00618371,9092020.0,75.0,Texas,Individual,(15E) Earmarked Contribution,"FISHER, GERALD",RETIRED,RETIRED
3,C00618371,9062020.0,100.0,Illinois,Individual,(15E) Earmarked Contribution,"FORNECKER, BOB",NAPERVILLE ELECTRICAL CONTRACTORS,OWNER
4,C00618371,9082020.0,105.0,Georgia,Individual,(15) Contribution from Individual,"FORNEL, HELGA",Undisclosed,Undisclosed

In [145]:
df1["TRANSACTION_DT"].unique()

array([9112020., 9042020., 9092020., ..., 6082010., 9062018., 3152018.])

In [146]:
# Convert TRANSACTION_DT to string first, then to datetime
df1['TRANSACTION_DT'] = df1['TRANSACTION_DT'].astype(int).astype(str)
df1['TRANSACTION_DT'] = pd.to_datetime(df1['TRANSACTION_DT'], format='%m%d%Y')

In [147]:
# Check if sorted in ascending order
is_sorted = df1["TRANSACTION_DT"].is_monotonic_increasing

print("âœ… Is TRANSACTION_DT sorted in ascending order?", is_sorted)

âœ… Is TRANSACTION_DT sorted in ascending order? False

In [148]:
df1.head()

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
0,C00618371,2020-09-11,45.0,Pennsylvania,Individual,(15E) Earmarked Contribution,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
1,C00618371,2020-09-04,35.0,Pennsylvania,Individual,(15E) Earmarked Contribution,"FREED, MARIANNE",SELF-EMPLOYED,CAREGIVER
2,C00618371,2020-09-09,75.0,Texas,Individual,(15E) Earmarked Contribution,"FISHER, GERALD",RETIRED,RETIRED
3,C00618371,2020-09-06,100.0,Illinois,Individual,(15E) Earmarked Contribution,"FORNECKER, BOB",NAPERVILLE ELECTRICAL CONTRACTORS,OWNER
4,C00618371,2020-09-08,105.0,Georgia,Individual,(15) Contribution from Individual,"FORNEL, HELGA",Undisclosed,Undisclosed

In [149]:
# Filter for dates between Jan 1, 2023 and Dec 31, 2024
df1 = df1[(df1['TRANSACTION_DT'] >= '2020-01-01') & (df1['TRANSACTION_DT'] <= '2020-12-31')]

# Verify the date range
print(df1['TRANSACTION_DT'].min())
print(df1['TRANSACTION_DT'].max())

2020-01-10 00:00:00
2020-12-31 00:00:00

In [150]:
# Sort by TRANSACTION_DT in ascending order
df1 = df1.sort_values('TRANSACTION_DT')

# Verify it's sorted
print("âœ… Is TRANSACTION_DT sorted in ascending order?", df1["TRANSACTION_DT"].is_monotonic_increasing)

âœ… Is TRANSACTION_DT sorted in ascending order? True

In [151]:
df1.head(10)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
27483889,C00703975,2020-01-10,250.0,Pennsylvania,Individual,(15E) Earmarked Contribution,"NELSON, MICHAEL",UNIVERSAL HEALTH SERVICES INC,IT MANAGEMENT
27565048,C00075820,2020-01-10,35.0,Tennessee,Individual,(15E) Earmarked Contribution,"CLEMENTS, JOEL",RETIRED,RETIRED
27565047,C00075820,2020-01-10,50.0,Tennessee,Individual,(15E) Earmarked Contribution,"CLEMENTS, JOEL",RETIRED,RETIRED
28800488,C00697441,2020-01-10,13.0,District of Columbia,Individual,(15) Contribution from Individual,"PREISS, BETH",FEDERAL HOUSING FINANCE AGENCY OIG,EVALUATOR
28800489,C00697441,2020-01-10,32.0,Pennsylvania,Individual,(15) Contribution from Individual,"BASSMAN, JAIME",INDEPENDENT CONTRACTOR,OCCUPATIONAL THERAPIST
28800624,C00696948,2020-01-10,27.0,Oregon,Individual,(15E) Earmarked Contribution,"FARBER, JEFFREY",NOT EMPLOYED,NOT EMPLOYED
28800639,C00696948,2020-01-10,10.0,Massachusetts,Individual,(15E) Earmarked Contribution,"EASTON-CALABRIA, AUGUST",NOT EMPLOYED,NOT EMPLOYED
28800996,C00696948,2020-01-10,10.0,New York,Individual,(15E) Earmarked Contribution,"FACTEAU, ERIK",HIGHVIEW CREATIONS,LANDSCAPING
27565046,C00075820,2020-01-10,25.0,Texas,Individual,(15E) Earmarked Contribution,"SURBER, CHERYL",RETIRED,RETIRED
28339474,C00696948,2020-01-10,2.0,California,Individual,(15E) Earmarked Contribution,"GUTIERREZ, JOE",DISNEY,FIELD SUPERINTENDENT

In [152]:
df1.tail(20)

,CMTE_ID,TRANSACTION_DT,TRANSACTION_AMT,STATE,ENTITY_TP,TRANSACTION_TP,NAME,EMPLOYER,OCCUPATION
57217859,C00010603,2020-12-31,50.0,Kentucky,Individual,(15E) Earmarked Contribution,"GILEZAN, WAYNE L.",ADVANCEDPAVING,CONTRACTOR
57990152,C00009639,2020-12-31,50.0,North Carolina,Individual,(15) Contribution from Individual,"STEEN, MICHAEL W",MCGRIFF INSURANCE SERVICES INC.,EMPLOYEE BENEFITS INSURANCE AG
57990151,C00009639,2020-12-31,12.0,North Carolina,Individual,(15) Contribution from Individual,"STARLING, KRISTY H",TRUIST BANK,DEPOSITS AND OPERATIONS SERVIC
57217860,C00010603,2020-12-31,25.0,Illinois,Individual,(15E) Earmarked Contribution,"GILFILLIAN, JACQUELINE",Undisclosed,Undisclosed
57217952,C00000935,2020-12-31,5.0,Arkansas,Individual,(15E) Earmarked Contribution,"FAISON, SANDRA",Undisclosed,NOT EMPLOYED
57217861,C00010603,2020-12-31,25.0,New York,Individual,(15E) Earmarked Contribution,"RAMSEY, JANET & JOHN",RETIRED,RETIRED
57217862,C00010603,2020-12-31,50.0,Ohio,Individual,(15E) Earmarked Contribution,"RAMIREZ, WALESKA",BLESSED JOHN XXIII CATHOLIC CHURCH,HOUSEWIFE
57990149,C00009639,2020-12-31,12.0,Tennessee,Individual,(15) Contribution from Individual,"SPARKS, WILLIAM C",MCGRIFF INSURANCE SERVICES INC.,BUSINESS INSURANCE AGENT
56980972,C00000935,2020-12-31,25.0,Texas,Individual,(15E) Earmarked Contribution,"QUINN, PAULINE",Undisclosed,NOT EMPLOYED
56980971,C00000935,2020-12-31,25.0,Florida,Individual,(15E) Earmarked Contribution,"PUTNAM, ROSEMARY",SELF-EMPLOYED,RETAIL
57217863,C00010603,2020-12-31,100.0,Connecticut,Individual,(15E) Earmarked Contribution,"SEAMAN, LINDA",Undisclosed,Undisclosed
56980969,C00000935,2020-12-31,19.0,Florida,Individual,(15E) Earmarked Contribution,"JENNIS, GARY",Undisclosed,NOT EMPLOYED
57990148,C00009639,2020-12-31,12.0,North Carolina,Individual,(15) Contribution from Individual,"HANNA, DAVID P",TRUIST BANK,ASSISTANT MANAGER OF INVESTOR
57217864,C00010603,2020-12-31,10.0,New Mexico,Individual,(15E) Earmarked Contribution,"HACKER, KENNETH",NMSU,UNIVERSITY ADMINISTRATOR
57599435,C00027466,2020-12-31,16.0,New York,Individual,(15E) Earmarked Contribution,"DELIETO, NEIL",RETIRED,RETIRED
57217939,C00000935,2020-12-31,50.0,New York,Individual,(15E) Earmarked Contribution,"GAMBLE, JILL",Undisclosed,NOT EMPLOYED
56980959,C00000935,2020-12-31,15.0,New York,Individual,(15E) Earmarked Contribution,"RODRIGUEZ, MARGARITA",Undisclosed,NOT EMPLOYED
57217944,C00000935,2020-12-31,15.0,Michigan,Individual,(15E) Earmarked Contribution,"RHEIN, ELIZABETH",GDK CONSTRUCTION,MARKETING COORDINATOR
57990150,C00009639,2020-12-31,14.0,Maryland,Individual,(15) Contribution from Individual,"SPRINGMANN, SCOTT M",TRUIST BANK,MARKET PRESIDENT VI
56934749,C00401224,2020-12-31,1.0,California,Individual,(15) Contribution from Individual,"GLACKIN, MARY ELLEN",NOT EMPLOYED,NOT EMPLOYED

In [153]:
df1.shape

(34465962, 9)

In [ ]:
# Save cleaned dataset for Tableau
df1.to_csv("Individual_contribution_2019_2020.csv", index=False)
print("âœ… File saved as: Individual_contribution_2019_2020.csv")

âœ… File saved as: Individual_contribution_2019_2020.csv

: